fpistm/Arduino_Core_STM32/libraries/SrcWrapper/src/stm32/analog.cpp
  AdcChannelConf.Channel      = channel;                          /* Specifies the channel to configure into ADC */

#if defined(STM32G4xx) || defined(STM32H5xx) || defined(STM32L4xx) || \
    defined(STM32L5xx) || defined(STM32U3xx) || defined(STM32WBxx)
  if (!IS_ADC_CHANNEL(&AdcHandle, AdcChannelConf.Channel)) {
#else
  if (!IS_ADC_CHANNEL(AdcChannelConf.Channel)) {
#endif
    return 0;
  }

#if defined(STM32WB0x) || defined(STM32WL3x)
  AdcChannelConf.Rank = ADC_RANK_1;
  AdcChannelConf.VoltRange = voltageRange;
  AdcChannelConf.CalibrationPoint.Number = ADC_CALIB_POINT_1;

  uint32_t uADCxCalibrationPoint_Gain = 0;
  uint32_t uADCxCalibrationPoint_Offset = 0;
  if (channel != ADC_CHANNEL_VBAT && channel != ADC_CHANNEL_TEMPSENSOR) {
    /* Calibration point gain and offset */
    switch (voltageRange) {
      case ADC_VIN_RANGE_3V6:
        uADCxCalibrationPoint_Gain   = LL_ADC_GET_CALIB_GAIN_FOR_VINPX_3V6();
        uADCxCalibrationPoint_Offset = LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_3V6();
        if (uADCxCalibrationPoint_Gain == 0xFFF) {
          uADCxCalibrationPoint_Gain = LL_ADC_DEFAULT_RANGE_VALUE_3V6;
          uADCxCalibrationPoint_Offset = 0UL;
        }
        break;
      case ADC_VIN_RANGE_2V4:
        uADCxCalibrationPoint_Gain   = LL_ADC_GET_CALIB_GAIN_FOR_VINPX_2V4();
        uADCxCalibrationPoint_Offset = LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_2V4();
        if (uADCxCalibrationPoint_Gain == 0xFFF) {
          uADCxCalibrationPoint_Gain = LL_ADC_DEFAULT_RANGE_VALUE_2V4;
          uADCxCalibrationPoint_Offset = 0UL;
        }
        break;
      case ADC_VIN_RANGE_1V2:
        uADCxCalibrationPoint_Gain   = LL_ADC_GET_CALIB_GAIN_FOR_VINPX_1V2();
        uADCxCalibrationPoint_Offset = LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_1V2();
        if (uADCxCalibrationPoint_Gain == 0xFFF) {
          uADCxCalibrationPoint_Gain = LL_ADC_DEFAULT_RANGE_VALUE_1V2;
          uADCxCalibrationPoint_Offset = 0UL;
        }
        break;
      default:
        _Error_Handler("ADC: Unknown ADC_VOLT_RANGE", (int)(ADC_VOLT_RANGE));
        break;
    }
  }
  AdcChannelConf.CalibrationPoint.Gain = uADCxCalibrationPoint_Gain;
  AdcChannelConf.CalibrationPoint.Offset = uADCxCalibrationPoint_Offset;
#else
#if defined(ADC_SCAN_SEQ_FIXED) && defined(ADC_RANK_CHANNEL_NUMBER)
  AdcChannelConf.Rank         = ADC_RANK_CHANNEL_NUMBER;          /* Enable the rank of the selected channels when not fully configurable */
#else
  AdcChannelConf.Rank         = ADC_REGULAR_RANK_1;               /* Specifies the rank in the regular group sequencer */
#endif
#if !defined(STM32L0xx)
#if !defined(STM32G0xx)
  AdcChannelConf.SamplingTime = samplingTime;                     /* Sampling time value to be set for the selected channel */
#else
  AdcChannelConf.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;        /* Sampling time value to be set for the selected channel */
#endif
#endif
#if defined(ADC_DIFFERENTIAL_ENDED) && !defined(ADC1_V2_5)
  AdcChannelConf.SingleDiff   = ADC_SINGLE_ENDED;                 /* Single-ended input channel */
  AdcChannelConf.OffsetNumber = ADC_OFFSET_NONE;                  /* No offset subtraction */
#endif
#if !defined(STM32C0xx) && !defined(STM32F0xx) && !defined(STM32F1xx) && \
    !defined(STM32F2xx) && !defined(STM32G0xx) && !defined(STM32L0xx) && \
    !defined(STM32L1xx) && !defined(STM32U0xx) && !defined(STM32WBAxx) && \
    !defined(STM32WBxx) && !defined(STM32WLxx) && !defined(ADC1_V2_5)
  AdcChannelConf.Offset = 0;                                      /* Parameter discarded because offset correction is disabled */
#endif
#if defined (STM32H7xx) || defined(STM32MP1xx)
  AdcChannelConf.OffsetRightShift = DISABLE;                      /* No Right Offset Shift */
  AdcChannelConf.OffsetSignedSaturation = DISABLE;                /* Signed saturation feature is not used */
#endif
#endif /* STM32WB0x || STM32WL3x */
  /*##-2- Configure ADC regular channel ######################################*/
  if (HAL_ADC_ConfigChannel(&AdcHandle, &AdcChannelConf) != HAL_OK) {
    /* Channel Configuration Error */
    return 0;
  }

#if defined(ADC_CR_ADCAL) || defined(ADC_CR2_RSTCAL)
  /*##-2.1- Calibrate ADC then Start the conversion process ####################*/
#if defined(ADC_CALIB_OFFSET)
  if (HAL_ADCEx_Calibration_Start(&AdcHandle, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED) != HAL_OK)
#elif defined(ADC_SINGLE_ENDED) && !defined(ADC1_V2_5)
  if (HAL_ADCEx_Calibration_Start(&AdcHandle, ADC_SINGLE_ENDED) !=  HAL_OK)
#else
  if (HAL_ADCEx_Calibration_Start(&AdcHandle) !=  HAL_OK)
#endif
  {
    /* ADC Calibration Error */
    return 0;
  }
#endif

  /*##-3- Start the conversion process ####################*/
  if (HAL_ADC_Start(&AdcHandle) != HAL_OK) {
    /* Start Conversion Error */
    return 0;
  }

  /*##-4- Wait for the end of conversion #####################################*/
  /*  For simplicity reasons, this example is just waiting till the end of the
      conversion, but application may perform other tasks while conversion
      operation is ongoing. */
  if (HAL_ADC_PollForConversion(&AdcHandle, 10) != HAL_OK) {
    /* End Of Conversion flag not set on time */
    return 0;
  }

  /* Check if the continuous conversion of regular channel is finished */
#if defined(HAL_ADC_STATE_DS_EOC)
  if ((HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_DS_EOC) == HAL_ADC_STATE_DS_EOC) {
#else
  if ((HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_REG_EOC) == HAL_ADC_STATE_REG_EOC) {
#endif
    /*##-5- Get the converted value of regular channel  ########################*/
    uhADCxConvertedValue = HAL_ADC_GetValue(&AdcHandle);
  }

  if (HAL_ADC_Stop(&AdcHandle) != HAL_OK) {
    /* Stop Conversation Error */
    return 0;
  }

  if (HAL_ADC_DeInit(&AdcHandle) != HAL_OK) {
    return 0;
  }

#if defined(LL_ADC_PATH_INTERNAL_NONE)
  if (__LL_ADC_COMMON_INSTANCE(AdcHandle.Instance) != 0U) {
    LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(AdcHandle.Instance), LL_ADC_PATH_INTERNAL_NONE);
  }
#endif
  return uhADCxConvertedValue;
}
#endif /* HAL_ADC_MODULE_ENABLED */
#endif /* !HAL_ADC_MODULE_ONLY */

#if !defined(HAL_ADC_MODULE_ONLY)
/* DAC */
#if defined(USE_HAL_DAC_MODULE) && (USE_HAL_DAC_MODULE == 1)
void dac_init(hal_dac_t instance, PinName pin)
{
  /* DAC Periph clock enable */
#ifdef DAC1
  if (instance == HAL_DAC1) {
    HAL_RCC_DAC1_EnableClock();
  }
#endif

  /* Configure DAC GPIO pin */
  pinmap_pinout(pin, PinMap_DAC);
}

void dac_deinit(hal_dac_t instance, PinName pin)
{
  /* DAC Periph clock disable */
#ifdef DAC1
  if (instance == HAL_DAC1) {
    HAL_RCC_DAC1_DisableClock();
  }
#endif
  /* Deconfigure DAC GPIO pin */
  pin_function(pin, STM_PIN_DATA(STM_MODE_ANALOG, LL_GPIO_PULL_NO, 0));
}

/**
  * @brief  Return DAC HAL channel linked to a PinName
  * @param  pin: specific PinName's for ADC internal.
  * @retval Valid HAL channel
  */
hal_dac_channel_t get_dac_channel(PinName pin)
{
  uint32_t function = pinmap_function(pin, PinMap_DAC);
  hal_dac_channel_t channel;
  switch (STM_PIN_CHANNEL(function)) {
    case 1:
      channel = HAL_DAC_CHANNEL_1;
      break;
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
    case 2:
      channel = HAL_DAC_CHANNEL_2;
      break;
#endif
    default:
      _Error_Handler("DAC: Unknown dac channel", (int)(STM_PIN_CHANNEL(function)));
      break;
  }
  return channel;
}

/**
  * @brief  This function will set the DAC to the required value
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @param  value : the value to push on the adc output
  * @param  do_init : if set to true the initialization of the adc is done
  * @retval None
  */
void dac_write_value(PinName pin, uint32_t value, bool do_init)
{
  hal_status_t status = HAL_OK;
  hal_dac_handle_t dac_handle;
  hal_dac_config_t dac_config;
  hal_dac_channel_config_t dac_channel_config;
  hal_dac_t instance = HAL_DAC1;
  instance = (hal_dac_t)((uint32_t)pinmap_peripheral(pin, PinMap_DAC));
  if (instance != NP) {
    hal_dac_channel_t dacChannel = get_dac_channel(pin);
    /* Initialization of DAC instance */
    status = HAL_DAC_Init(&dac_handle, instance) ;
    if ((do_init) && (status == HAL_OK)) {
      /*##-1- Configure the DAC peripheral #######################################*/
      g_current_pin = pin;
      dac_init(instance, pin);

